test/artillery/flow.yaml
config:
  plugins:
    metrics-by-endpoint: {}
  target: http://localhost:8080/api
  phases:
    - duration: 10
      arrivalRate: 50
scenarios:
  - name: login
    flow:
      - log: login
      - post:
          url: /sessions/login
          json:
            email: sebasavila81@gmail.com
            password: 123
      - log: read all products
      - get:
          url: /products